src/Documents/НачислениеЕНП/НачислениеЕНП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеЕНП</name>
  <basedOn>Document.ПерерасчетИмущественныхНалогов</basedOn>
  <registerRecords>AccumulationRegister.РасчетыПоНалогамНаЕдиномНалоговомСчете</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияПоПрочимАктивамПассивам</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДоходыРасходыПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.УплатаНДФЛНалоговымиАгентамиКРаспределению</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСФондамиПоСтраховымВзносам</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛПеречисленный</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.МеждународныйБезКорреспонденции</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛКПеречислению</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоСанкциямНаЕдиномНалоговомСчете</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоЕдиномуНалоговомуСчету</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредварительноеУведомлениеПоНДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТипНалога</name>
    <type>
      <types>EnumRef.ТипыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОкончаниеОтчетногоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПерерасчетИмущественныхНалогов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаНалогов</name>
    <attributes>
      <name>ТипНалога</name>
      <type>
        <types>EnumRef.ТипыНалогов</types>
      </type>
    </attributes>
    <attributes>
      <name>КодБК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокУплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормироватьУведомление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ТипыНалогов/ТипыНалогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогов</name>
  <enumValues>
    <name>ЕдиныйНалоговыйПлатеж</name>
  </enumValues>
  <enumValues>
    <name>ЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ЕСХН</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог</name>
  </enumValues>
  <enumValues>
    <name>НалогНаИмущество</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_РегиональныйБюджет</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_ФедеральныйБюджет</name>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль_НалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>НДС</name>
  </enumValues>
  <enumValues>
    <name>НДС_ВвозимыеТовары</name>
  </enumValues>
  <enumValues>
    <name>НДС_НалоговыйАгент</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ</name>
  </enumValues>
  <enumValues>
    <name>НДФЛ_ИП</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеНалогиИСборы</name>
  </enumValues>
  <enumValues>
    <name>ТорговыйСбор</name>
  </enumValues>
  <enumValues>
    <name>ТранспортныйНалог</name>
  </enumValues>
  <enumValues>
    <name>УСН_Доходы</name>
  </enumValues>
  <enumValues>
    <name>УСН_ДоходыМинусРасходы</name>
  </enumValues>
  <enumValues>
    <name>УСН_МинимальныйНалог</name>
  </enumValues>
  <enumValues>
    <name>ПФРПоСуммарномуТарифу</name>
  </enumValues>
  <enumValues>
    <name>ПФРСтраховаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>ПФРНакопительнаяЧасть</name>
  </enumValues>
  <enumValues>
    <name>ПФРДополнительныйТарифЛЭ</name>
  </enumValues>
  <enumValues>
    <name>ПФРДополнительныйТарифШахтеры</name>
  </enumValues>
  <enumValues>
    <name>ПФРЗаЗанятыхНаПодземныхИВредныхРаботах</name>
  </enumValues>
  <enumValues>
    <name>ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах</name>
  </enumValues>
  <enumValues>
    <name>ПФРСПревышения</name>
  </enumValues>
  <enumValues>
    <name>ФФОМС</name>
  </enumValues>
  <enumValues>
    <name>ТФОМС</name>
  </enumValues>
  <enumValues>
    <name>ФСС</name>
  </enumValues>
  <enumValues>
    <name>ФССНС</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоходыКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДивиденды</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДивидендыСотрудникам</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДоначисленныйПоРезультатамПроверки</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПередачаЗадолженностиВНалоговыйОрган</name>
  </enumValues>
  <enumValues>
    <name>НДФЛПрочиеРасчетыСПерсоналом</name>
  </enumValues>
  <enumValues>
    <name>НДФЛСПревышения</name>
  </enumValues>
  <enumValues>
    <name>НДФЛДивидендыСПревышения</name>
  </enumValues>
  <enumValues>
    <name>ПФРДоПредельнойВеличины</name>
  </enumValues>
  <enumValues>
    <name>НДС_ОбратноеОбложение</name>
  </enumValues>
  <enumValues>
    <name>АУСН</name>
  </enumValues>
  <enumValues>
    <name>СтраховыеВзносыЕдиныйТариф</name>
  </enumValues>
  <enumValues>
    <name>ОПСИностранныхРаботников</name>
  </enumValues>
  <enumValues>
    <name>ОМСИностранныхРаботников</name>
  </enumValues>
  <enumValues>
    <name>ОССИностранныхРаботников</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/РегистрацииВНалоговомОргане/РегистрацииВНалоговомОргане.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РегистрацииВНалоговомОргане</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>Доверенность</name>
    <comment>Доверенность налогоплательщика на представителя</comment>
    <type>
      <types>CatalogRef.ДоверенностиНалогоплательщика</types>
      <types>CatalogRef.МашиночитаемыеДоверенностиФНС</types>
      <types>CatalogRef.МашиночитаемыеДоверенностиРаспределенныйРеестр</types>
      <types>CatalogRef.МашиночитаемыеДоверенности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПредставителя</name>
    <comment>Название документа, подтверждающего полномочия представителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойИндексОбособленногоПодразделения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>Код причины постановки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИФНС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОбособленногоПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Представитель</name>
    <comment>Представитель в территориальном органе ФНС</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УполномоченноеЛицоПредставителя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодРегиона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСлужебное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПостановкиНаУчет</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСнятияСУчета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <comment>Филиал / ГО</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подписанты</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Доверенность</name>
      <comment>Доверенность налогоплательщика на представителя</comment>
      <type>
        <types>CatalogRef.ДоверенностиНалогоплательщика</types>
        <types>CatalogRef.МашиночитаемыеДоверенностиФНС</types>
        <types>CatalogRef.МашиночитаемыеДоверенностиРаспределенныйРеестр</types>
        <types>CatalogRef.МашиночитаемыеДоверенности</types>
      </type>
    </attributes>
    <attributes>
      <name>Представитель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УполномоченноеЛицоПредставителя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПредставителя</name>
      <comment>Название документа, подтверждающего полномочия представителя</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/НачислениеЕНП/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПерерасчетИмущественныхНалогов") Тогда
		ЗаполнитьПоПерерасчетуИмущественныхНалогов(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ПлатежиВБюджет.ИспользуетсяЕдиныйНалоговыйПлатеж(Организация, Дата) Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Организация %1 не является плательщиком единого налогового платежа';
				|en = '%1 company is not a unified tax payer'"),
			Организация);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Организация", "Объект", Отказ);
		Возврат;
	КонецЕсли;
	
	РегистрацияОрганизацииВНО = Справочники.РегистрацииВНалоговомОргане.РегистрацияВНалоговомОргане(Организация, Дата);
	Если НЕ ЗначениеЗаполнено(РегистрацияОрганизацииВНО) Тогда
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Для организации %1 на дату документа не указана основная регистрация в налоговом органе';
				|en = 'For the %1 company, the main registration with the tax authority is not specified as of the document date'"),
			Организация);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Организация", "Объект", Отказ);
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из СписокИспользуемыхРегистрацийВНО(РегистрацияОрганизацииВНО) Цикл
		
		Если ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементСписка.Значение, "КодПоОКТМО")) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Для регистрации в налоговом органе %1 не указан код по ОКТМО';
				|en = 'For registration with the %1 tax authority, the RNCMT code is required'"),
			ЭлементСписка.Значение);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , ЭлементСписка.Представление, "Объект", Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("ПроведениеНачислениеЕНП");
	ДополнительныеСвойства.Вставить("ОписаниеЗамера", ОписаниеЗамера);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	СуммаДокумента = РасшифровкаНалогов.Итог("Сумма");
	
	ОбщегоНазначенияУТ.ЗаполнитьИдентификаторыДокумента(ЭтотОбъект, "РасшифровкаНалогов");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
	ОписаниеЗамера = Неопределено;
	Если ДополнительныеСвойства.Свойство("ОписаниеЗамера", ОписаниеЗамера) Тогда
		ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, 1);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СписокИспользуемыхРегистрацийВНО(Знач ОсновнаяРегистрация)
	
	СписокРегистраций = Новый СписокЗначений;
	Для Каждого СтрокаТаблицы Из РасшифровкаНалогов Цикл
		
		Если ТипЗнч(СтрокаТаблицы.Субконто1) = Тип("СправочникСсылка.РегистрацииВНалоговомОргане") И ЗначениеЗаполнено(СтрокаТаблицы.Субконто1) Тогда
			ПутьКДанным = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РасшифровкаНалогов", СтрокаТаблицы.НомерСтроки, "Субконто1");
			РегистрацияВНО = СтрокаТаблицы.Субконто1;
		ИначеЕсли ТипЗнч(СтрокаТаблицы.Субконто2) = Тип("СправочникСсылка.РегистрацииВНалоговомОргане") И ЗначениеЗаполнено(СтрокаТаблицы.Субконто2) Тогда
			ПутьКДанным = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РасшифровкаНалогов", СтрокаТаблицы.НомерСтроки, "Субконто2");
			РегистрацияВНО = СтрокаТаблицы.Субконто2;
		ИначеЕсли ТипЗнч(СтрокаТаблицы.Субконто3) = Тип("СправочникСсылка.РегистрацииВНалоговомОргане") И ЗначениеЗаполнено(СтрокаТаблицы.Субконто3) Тогда
			ПутьКДанным = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РасшифровкаНалогов", СтрокаТаблицы.НомерСтроки, "Субконто3");
			РегистрацияВНО = СтрокаТаблицы.Субконто3;
		Иначе
			РегистрацияВНО = ОсновнаяРегистрация;
			ПутьКДанным = "Организация";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РегистрацияВНО) И СписокРегистраций.НайтиПоЗначению(РегистрацияВНО) = Неопределено Тогда
			СписокРегистраций.Добавить(РегистрацияВНО, ПутьКДанным);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокРегистраций;
	
КонецФункции

Процедура ЗаполнитьПоПерерасчетуИмущественныхНалогов(ДанныеЗаполнения)
	
	РеквизитыДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения,
									"Проведен, Организация, Дата, ОсновноеСредство");
	
	// Ввод Начисления ЕНП только на основании проведенных перерасчетов имущественных налогов.
	Если ДанныеЗаполнения.Пустая() Или Не РеквизитыДокументаОснования.Проведен Тогда
		ТекстОшибки = НСтр("ru = 'Начисление ЕНП можно создавать только на основании проведенных перерасчетов имущественных налогов.';
							|en = 'You can create the ""UTP charge"" document only based on the posted ""Recalculate property taxes"" document.'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	// Разрешено вводить только одно Начисление ЕНП на основании одного перерасчета имущественных налогов.
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НачислениеЕНП.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.НачислениеЕНП КАК НачислениеЕНП
	|ГДЕ
	|	НачислениеЕНП.ДокументОснование = &ДанныеЗаполнения";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДанныеЗаполнения", ДанныеЗаполнения);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ШаблонТекстаОшибки =  НСтр("ru = 'На основании %1
								 |уже создан документ %2';
								 |en = 'The %2 document
								 |is already created based on %1'");
			ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ДанныеЗаполнения, Выборка.Ссылка);
			ВызватьИсключение ТекстОшибки;
		КонецЦикла;
	КонецЕсли;
	
	// Заполним по перерасчету имущественных налогов.
	
	ТекстЗапроса = 
	"ВЫБРАТЬ 
	|	ПерерасчетИмущественныхНалогов.Ссылка КАК ДокументОснование,
	|	ПерерасчетИмущественныхНалогов.Организация КАК Организация
	|ИЗ
	|	Документ.ПерерасчетИмущественныхНалогов КАК ПерерасчетИмущественныхНалогов
	|ГДЕ
	|	ПерерасчетИмущественныхНалогов.Ссылка = &ДанныеЗаполнения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПерерасчетИмущественныхНалогов.ВидНалога = ЗНАЧЕНИЕ(перечисление.ВидыИмущественныхНалогов.ЗемельныйНалог)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ЗемельныйНалог)
	|		КОГДА ПерерасчетИмущественныхНалогов.ВидНалога = ЗНАЧЕНИЕ(перечисление.ВидыИмущественныхНалогов.ТранспортныйНалог)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ТранспортныйНалог)
	|		КОГДА ПерерасчетИмущественныхНалогов.ВидНалога = ЗНАЧЕНИЕ(перечисление.ВидыИмущественныхНалогов.НалогНаИмущество)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.НалогНаИмущество)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПустаяСсылка)
	|	КОНЕЦ КАК ТипНалога,
	|	ВЫБОР
	|		КОГДА ПерерасчетИмущественныхНалогов.ВидНалога = ЗНАЧЕНИЕ(перечисление.ВидыИмущественныхНалогов.ЗемельныйНалог)
	|			ТОГДА ЕСТЬNULL(РегистрацияЗемельногоУчастка.КБК, """")
	|		КОГДА ПерерасчетИмущественныхНалогов.ВидНалога = ЗНАЧЕНИЕ(перечисление.ВидыИмущественныхНалогов.ТранспортныйНалог)
	|			ТОГДА &КБКТранспортногоНалога
	|		КОГДА ПерерасчетИмущественныхНалогов.ВидНалога = ЗНАЧЕНИЕ(перечисление.ВидыИмущественныхНалогов.НалогНаИмущество)
	|			ТОГДА &КБКНалогаНаИмущество
	|	КОНЕЦ КАК КодБК,
	|	ПерерасчетИмущественныхНалогов.СуммаКорректировки * ВЫБОР
	|		КОГДА
	|			ПерерасчетИмущественныхНалогов.ВариантПерерасчета = ЗНАЧЕНИЕ(Перечисление.ВариантыПерерасчетаИмущественныхНалогов.Доначислить)
	|			ТОГДА 1
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК Сумма,
	|	ПерерасчетИмущественныхНалогов.НачалоПериода КАК НачалоПериода,
	|	ПерерасчетИмущественныхНалогов.КонецПериода КАК КонецПериода,
	|	ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ПерерасчетИмущественныхНалогов.КонецПериода, Квартал), день, 28) КАК СрокУплаты,
	|	ВЫБОР
	|		КОГДА ПерерасчетИмущественныхНалогов.ВидНалога = ЗНАЧЕНИЕ(перечисление.ВидыИмущественныхНалогов.ЗемельныйНалог)
	|			ТОГДА &СчетУчетаЗемельногоНалога
	|		КОГДА ПерерасчетИмущественныхНалогов.ВидНалога = ЗНАЧЕНИЕ(перечисление.ВидыИмущественныхНалогов.ТранспортныйНалог)
	|			ТОГДА &СчетУчетаТранспортногоНалога
	|		КОГДА ПерерасчетИмущественныхНалогов.ВидНалога = ЗНАЧЕНИЕ(перечисление.ВидыИмущественныхНалогов.НалогНаИмущество)
	|			ТОГДА &СчетУчетаНалогаНаИмущество
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыПлатежейВГосБюджет.НалогСам) КАК Субконто1,
	|	ПерерасчетИмущественныхНалогов.НалоговыйОрган КАК Субконто2,
	|	ЛОЖЬ КАК ФормироватьУведомление
	|ИЗ
	|	Документ.ПерерасчетИмущественныхНалогов КАК ПерерасчетИмущественныхНалогов
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрацияЗемельныхУчастков_СрезПоследних КАК РегистрацияЗемельногоУчастка
	|	ПО ПерерасчетИмущественныхНалогов.ОсновноеСредство = РегистрацияЗемельногоУчастка.ОсновноеСредство
	|ГДЕ
	|	ПерерасчетИмущественныхНалогов.Ссылка = &ДанныеЗаполнения";
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("СчетУчетаЗемельногоНалога",    ПланыСчетов.Хозрасчетный.ЗемельныйНалог);
	Запрос.УстановитьПараметр("СчетУчетаТранспортногоНалога", ПланыСчетов.Хозрасчетный.ТранспортныйНалог);
	Запрос.УстановитьПараметр("СчетУчетаНалогаНаИмущество",   ПланыСчетов.Хозрасчетный.НалогНаИмущество);
	
	Запрос.УстановитьПараметр("КБКТранспортногоНалога", 
								Перечисления.ТипыНалогов.КБКПоВидуНалоговогоОбязательства(
									Перечисления.ТипыНалогов.ТранспортныйНалог));
									
	Запрос.УстановитьПараметр("КБКНалогаНаИмущество", 
								Перечисления.ТипыНалогов.КБКПоВидуНалоговогоОбязательства(
									Перечисления.ТипыНалогов.НалогНаИмущество));
									
	// КБК земельного налога берем на дату перерасчета из параметров начисления земельного налога по ОС, с учетом исправлений.
	СписокОС = Новый Массив;
	СписокОС.Добавить(РеквизитыДокументаОснования.ОсновноеСредство);
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("МенеджерВременныхТаблиц", Запрос.МенеджерВременныхТаблиц);
	ПараметрыРасчета.Вставить("Организация", РеквизитыДокументаОснования.Организация);
	ПараметрыРасчета.Вставить("ПериодРасчета", РеквизитыДокументаОснования.Дата);
	ПараметрыРасчета.Вставить("СписокОС", СписокОС);
	
	РасчетИмущественныхНалоговУП.СформироватьТаблицуРегистрацияЗемельныхУчастковСрезПоследних(ПараметрыРасчета, 
																								РеквизитыДокументаОснования.Дата, 
																								Неопределено);
	
	Результат = Запрос.ВыполнитьПакет();
	ДанныеШапки = Результат.Получить(0);
	Если ДанныеШапки.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаШапки = ДанныеШапки.Выбрать();
	ВыборкаШапки.Следующий();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапки);
	
	ДанныеТаблицы = Результат.Получить(1);
	
	РасшифровкаНалогов.Загрузить(ДанныеТаблицы.Выгрузить());
		
Конецпроцедуры

#КонецОбласти

#КонецЕсли
